<template>
  <div class="rotatingNavigation">
    <div class="rotatingAg" @click="rotaFunc">
        </div>
    <div class="about" :class="data.rotateState ? 'aboutStyle' : ''">
        <p>首页</p>
        <p>关于</p>
        <p>文化</p>
    </div>
    <div class="content" :class="data.rotateState ? 'rotaStyle' : ''">
        <div class="main">
            <h2>广东巩固工业经济企稳回升：今年将推动8500家工业企业技术改造</h2>
            <h4>2022年07月21日 18:53 21世纪经济报道</h4>
            <h5>南方财经全媒体记者黄浩博 广州报道 7月21日，广东省工业和信息化厅召开2022年二季度新闻发布会，介绍上半年广东工业和信息化运行情况。

            数据显示，上半年，广东规上工业增加值同比增长3.5%，比GDP增速（2%）高1.5个百分点，与全国比较看，广东规上工业增加值增速比全国（3.4%）高0.1个百分点，累计增速连续三个月高于全国。

            同时，工业经济“压舱石”作用不断增强，规上工业增加值占GDP比重为32.1%，比去年同期（30%）提高2.1个百分点；对GDP增长的贡献率达到55.4%，比去年同期（40.7%）高14.7个百分点。

            “上半年，广东全省工业经济运行总体平稳，工业投资持续较快增长，产业结构不断优化，工业经济运行在合理区间。”广东省工信厅党组成员、副厅长吴东文指出，接下来，广东将针对当前工业企业所急所盼，研究完善稳工业增长有关政策措施，出台“稳工业32条”2.0版，巩固工业生产企稳回升势头。

            2.25万家规上企业数字化转型

            尽管面对需求收缩、供给冲击、预期转弱“三重压力”，广东产业结构优化调整的步伐仍未停止。

            数据显示，上半年，先进制造业增加值同比增长4.1%，比全省规上工业高0.6个百分点；占全省规上工业比重53.8%。高技术制造业增加值同比增长6.4%，比全省规上工业高2.9个百分点；占全省规上工业比重29%。

            分行业来看，电子信息业增加值增长4.3%，石油化工业增长0.4%，电气机械业增长3.4%，汽车制造业增长18.8%。

            尤其是以新能源汽车为代表的新兴产业呈现较快增长势头，已成为工业经济增长重要新动能。上半年，广东新能源汽车产量同比增长166.8%；医疗仪器设备及器械产量同比增长49%；无人机产量同比增长28.8%。

            “新经济、新产业(43.140, -0.78, -1.78%)是推动广东制造业高质量发展的重要引擎，从数据看，广东应把握产业链重塑窗口期，坚持朝着更高水平产业结构优化调整。” 中山大学岭南学院经济学系教授林江在接受南方财经全媒体记者采访时表示，战略性新兴产业长远发展需要在提振市场信心的基础上，创造满足市场需求的新产品、新订单，为新兴产业发展循环造血。

            数字化转型已经成为广东培育壮大发展新动能的重要途径。据介绍，截至6月底，全省累计推动2.25万家规上工业企业运用工业互联网数字化转型，带动65万家中小企业“上云用云”。

            南方财经全媒体记者注意到，为进一步促进数字经济与实体经济深度融合，今年7月，广东省发布《广东省数字经济发展指引1.0》（下称《指引》），成为全国省级层面首个推动数字经济发展的指引性文件。

            《指引》系统提出了广东省数字经济发展“2221”的总体框架，即：数字产业化和产业数字化“两大核心”、数据资源和数字技术“两大要素”、核心数字基础产品和新型数字基础设施“两大基础”、以及数字政府改革建设和服务支撑体系“一个保障体系”。

            “数字经济已成为引领广东经济高质量发展的新动能、新引擎和主阵地，希望通过《指引》引导各地各部门、社会各界共同参与数字经济建设。”广东省工信厅数字产业处处长万淑萍表示，接下来，广东省工信厅将持续扩大《指引》的影响力，使广东各行各业应知尽知。其次，将其纳入领导干部数字能力培训提升计划，使各级领导干部应会尽会，此外还将加强对数字经济重点企业、重点人才特别是企业首席数据官的培训，通过实践更新迭代《指引》。</h5>
            <h3>开展技改提升产业链竞争力</h3>
            <img src="http://www.kuoo8.com/upload/2022-07/16584058233336896.jpg" alt="">
            <h5>南方财经全媒体记者黄浩博 广州报道 7月21日，广东省工业和信息化厅召开2022年二季度新闻发布会，介绍上半年广东工业和信息化运行情况。

            数据显示，上半年，广东规上工业增加值同比增长3.5%，比GDP增速（2%）高1.5个百分点，与全国比较看，广东规上工业增加值增速比全国（3.4%）高0.1个百分点，累计增速连续三个月高于全国。

            同时，工业经济“压舱石”作用不断增强，规上工业增加值占GDP比重为32.1%，比去年同期（30%）提高2.1个百分点；对GDP增长的贡献率达到55.4%，比去年同期（40.7%）高14.7个百分点。

            “上半年，广东全省工业经济运行总体平稳，工业投资持续较快增长，产业结构不断优化，工业经济运行在合理区间。”广东省工信厅党组成员、副厅长吴东文指出，接下来，广东将针对当前工业企业所急所盼，研究完善稳工业增长有关政策措施，出台“稳工业32条”2.0版，巩固工业生产企稳回升势头。

            2.25万家规上企业数字化转型

            尽管面对需求收缩、供给冲击、预期转弱“三重压力”，广东产业结构优化调整的步伐仍未停止。

            数据显示，上半年，先进制造业增加值同比增长4.1%，比全省规上工业高0.6个百分点；占全省规上工业比重53.8%。高技术制造业增加值同比增长6.4%，比全省规上工业高2.9个百分点；占全省规上工业比重29%。

            分行业来看，电子信息业增加值增长4.3%，石油化工业增长0.4%，电气机械业增长3.4%，汽车制造业增长18.8%。

            尤其是以新能源汽车为代表的新兴产业呈现较快增长势头，已成为工业经济增长重要新动能。上半年，广东新能源汽车产量同比增长166.8%；医疗仪器设备及器械产量同比增长49%；无人机产量同比增长28.8%。

            “新经济、新产业(43.140, -0.78, -1.78%)是推动广东制造业高质量发展的重要引擎，从数据看，广东应把握产业链重塑窗口期，坚持朝着更高水平产业结构优化调整。” 中山大学岭南学院经济学系教授林江在接受南方财经全媒体记者采访时表示，战略性新兴产业长远发展需要在提振市场信心的基础上，创造满足市场需求的新产品、新订单，为新兴产业发展循环造血。

            数字化转型已经成为广东培育壮大发展新动能的重要途径。据介绍，截至6月底，全省累计推动2.25万家规上工业企业运用工业互联网数字化转型，带动65万家中小企业“上云用云”。

            南方财经全媒体记者注意到，为进一步促进数字经济与实体经济深度融合，今年7月，广东省发布《广东省数字经济发展指引1.0》（下称《指引》），成为全国省级层面首个推动数字经济发展的指引性文件。

            《指引》系统提出了广东省数字经济发展“2221”的总体框架，即：数字产业化和产业数字化“两大核心”、数据资源和数字技术“两大要素”、核心数字基础产品和新型数字基础设施“两大基础”、以及数字政府改革建设和服务支撑体系“一个保障体系”。

            “数字经济已成为引领广东经济高质量发展的新动能、新引擎和主阵地，希望通过《指引》引导各地各部门、社会各界共同参与数字经济建设。”广东省工信厅数字产业处处长万淑萍表示，接下来，广东省工信厅将持续扩大《指引》的影响力，使广东各行各业应知尽知。其次，将其纳入领导干部数字能力培训提升计划，使各级领导干部应会尽会，此外还将加强对数字经济重点企业、重点人才特别是企业首席数据官的培训，通过实践更新迭代《指引》。</h5>
        </div>
    </div>
  </div>
</template>
<script>
import { reactive } from 'vue'
export default {
  name: 'RotatingNavigation',
  setup () {
    const data = reactive({
      rotateState: false
    })
    function rotaFunc () {
      data.rotateState = !data.rotateState
    }
    return {
      data,
      rotaFunc
    }
  }
}
</script>
<style lang="scss">
.rotatingNavigation{
    background-color: black;
    overflow: hidden;
    .about{
        position: absolute;
        bottom: 50px;
        left: -200px;
        color: wheat;
        transition: all 0.8s ease-in;
        p:nth-child(2){
            text-indent: 2rem;
        }
        p:nth-child(3){
            text-indent: 4rem;
        }
    }
    .aboutStyle{
        left: 50px;
        transition: all 0.8s ease-in;
    }
    .rotaStyle{
        transform: rotateZ(-20deg);
        transition: all 0.5s ease-in;
    }
}
.content {
    width: 100%;
    text-align: center;
    background-color: #ccc;
    overflow: hidden;
    transform-origin:0% 0%;
    transition: all 0.8s ease-in;
    .main{
        width: 50%;
        margin: 0 auto;
}
}
.rotatingAg{
    cursor:pointer;
    border-radius: 50%;
    width: 200px;
    height: 200px;
    background-color: red;
    position: absolute;
    top: 0;
    left: 0;
    z-index: 1;
    transform: translate(-50%, -50%);
}
</style>
